---
kind: type
id: T:Autodesk.Revit.DB.Electrical.LightingFixture
source: html/5b2588f2-62a5-f395-33d9-8d75355bf0b6.htm
---
# Autodesk.Revit.DB.Electrical.LightingFixture

Provides access to the Lighting Fixture in Autodesk Revit MEP.

## Syntax (C#)
```csharp
public class LightingFixture : MEPModel
```

## Remarks
The Lighting Fixture object can only be queried in Autodesk Revit MEP.